import receiptConfig from "./config/receiptConfig.js";

export const cashboxConfig = {
  name: "ТОВ ТЕСТ ПРРО",
  unit: 'Кафе "Мʼята"',
  address:
    "Дніпропетровська область, м. Дніпро, Амур-Нижньодніпровський район, вул. Шолом-Алейхема, 4, кв. (Офіс) 31",
  kodPdv: null,
  inn: "12345678",
  fn: "4000244601",
};
export const getServiceInputBodyMock = {
  sum: 2850,
  date: "16.05.2024",
  time: "19:28:35",
  receiptConfig,
  cashboxConfig,
};

export const getServiceOutputBodyMock = {
  sum: 750,
  date: "16.05.2024",
  time: "19:48:35",
  receiptConfig,
  cashboxConfig,
};

export const orderInfo = {
  orderNumber: 1650,
  orderType: "У закладі",
  openDate: "16 травня 2024 19:28:35",
  printDate: "16 травня 2024 19:29:35",
  tableId: 1,
  hallName: "Зал 1",
  guestAmount: 2,
};

export const productsInfo = [
  {
    uktzed: "2204109600#",
    barcode: "12345678",
    exciseStamp: "ADCC123123",
    name: "Вино игристое вкусное",
    amount: 2,
    price: 130.02,
    taxPrograms: "ДГ",
  },
  {
    uktzed: "2204888600#",
    barcode: "",
    exciseStamp: "",
    name: "Сир",
    amount: 4,
    price: 260,
    taxPrograms: "Д",
  },
];

export const taxesInfo = {
  total: 1300.04,
  card: 1100,
  cash: 200,
  taxes: [
    { name: "ПДВ Г 20%", value: 214.6, program: "Г" },
    { name: "Акцизний податок Д 5%", value: 12.38, program: "Д" },
  ],
};

export const roundInfo = [
  { name: "До сплати", value: 1300 },
  { name: "Заокруглення", value: 0.04 },
];

export const bankInfo = {
  bank: "ПриватБанк",
  terminal: "S1260S6Y",
  actionType: "Оплата",
  paymentSystem: "MASTERCARD",
  cardNumber: "1234********5678",
  authCode: 199016,
  rrn: "082699265208",
  cashier: "..........",
  holder: "..........",
};

export const footerInfo = {
  idDFS: "13eG45ty",
  inn: cashboxConfig.inn,
  printDate: "16.05.2024 19:29:35",
  fn: cashboxConfig.fn,
  status: "ОНЛАЙН",
  kodPdv: cashboxConfig.kodPdv,
};

// eslint-disable-next-line no-unused-vars
const expectedReceiptWithASCIIQR = [
  "              ТОВ ТЕСТ ПРРО             ",
  '              Кафе "Мʼята"              ',
  "  Дніпропетровська область, м. Дніпро,  ",
  "   Амур-Нижньодніпровський район, вул.  ",
  "    Шолом-Алейхема, 4, кв. (Офіс) 31    ",
  "               ІД 12345678              ",
  "----------------------------------------",
  "2204109600#                             ",
  "12345678                                ",
  "ADCC123123                              ",
  "Вино игристое 2 x 130,02   260,04   ДГ",
  "вкусное                               ",
  "",
  "2204888600#                             ",
  "Сир           4 x 260,00  1040,00    Д",
  "",
  "Готівкою                       200,00грн",
  "Карткою                       1100,00грн",
  "----------------------------------------",
  "Сума                          1300,04грн",
  "ПДВ Г 20%                         214,60",
  "Акцизний податок Д 5%              12,38",
  "----------------------------------------",
  "До сплати                     1300,00грн",
  "Заокруглення                     0,04грн",
  "",
  "----------------------------------------",
  "ПриватБанк                              ",
  "S1260S6Y                                ",
  "Оплата                                  ",
  "ЕПЗ                     1234********5678",
  "ПЛАТІЖНА СИСТЕМА              MASTERCARD",
  "КОД АВТ.                          199016",
  "RRN                         082699265208",
  "КАСИР                         ..........",
  "ДЕРЖАТЕЛЬ ЕПЗ                 ..........",
  "",
  "----------------------------------------",
  "                13eG45ty                ",
  "           16.05.2024 19:29:35          ",
  "               4000244601               ",
  "                 ОНЛАЙН                 ",
  "             ФІСКАЛЬНИЙ ЧЕК             ",
  "               Poster POS               ",
  " ▄▄▄▄▄ █▄▀ ▄ ▄██   █▀ █▄ ▄▀ ▄ █▀██ ▄▄▄▄▄",
  " █   █ ████▄▄  █▀█▀█▀▄▀▄▀▄▄█▀█▄▄▀█ █   █",
  " █▄▄▄█ ██ █ ▀▀▀█ ▄▄█▀ ▄ ▄▀▀▄█▀ ▄██ █▄▄▄█ ",
  "▄▄▄▄▄▄▄█ █ █▄█ ▀▄█ █ █▄▀ █ ▀▄█ █ █▄▄▄▄▄▄▄",
  "  ▀  ▀▄▀█▄▀  ▄▀▄▀▄█▄▀█ ▀▀▄▀▄▄▄  ██▄▀▀▀▀▀▄",
  "█▀ █ █▄▀  ▀▄▀ █ █▀▄ ▀██▄▄▄  ▄▀▀█  █▀ ▀▄▀▄",
  "█▄▄▄█▀▄▄ ▀ █  █▄▄▄  █▄ ▄█  ▀█ ▄▄█ █ ▀█▀  ",
  "▄▀  █ ▄ █▄ █ █▄▀▀ ▀▀ ▀▀ ▀█▄ ▀▄▀ █▄▄  ▄▄█ ",
  "█▄ ██▄▄ ▀▀█  ▄▄  ▀███▄█▄███ ▀▀▀▀▀██▄▀▄▄▀█",
  " █▄▄▄█▄▀▄▄▀▀▄█▄  █▄▄▄█ ▀ ▀▄▄███▄▄█ █▀▄ ▄▀",
  "██▀█▄ ▄█ ███▀▄▄ ██  ██ ███▄  █▀█ █▄▀▀▀ ▀▄",
  "▄ ▄█▀█▄█▄▀▄█▀▄█  ▀█  ▀ ▄▄▄▀  ▀█    █ ▀██▀",
  "▀▀ ▀▄ ▄▀█▄█ ▀ █ ▀█▀ ▄██ █ ▀  █▀▄ █  ▀   ▀",
  "█▄▀█ █▄   ▄▀▄██▀ ▄▄ ▄█▄  █▀▄█▄▀▄█▀  ██ ▄▄",
  "  ▄▄█▄▄▀▄ ▄▄▄█  █ █▀ ██ █▄█▄▀▄█▀▀▀▀▀▄▄███",
  "   ▄▀ ▄ ▀█▀▀ ▀▀ █▀ ▄▄██▀▄▀█ ███▀██▀█▀██▀ ",
  "▄▄█▄█▄▄█▀▄ ▀██▄▄▀▄▀ █▄█▀ ▄▀ █▄█  ▄▄▄ ██ ▀",
  " ▄▄▄▄▄ ██ ▄█ ▄  █▀▄ ▄███▀▄▀ ██▄  █▄█ ████",
  " █   █ █ ▀█ █   ▄▄ ▄▄█ ▄▀ ▀▀▄▄█▄  ▄▄▄▄▀▀▄",
  " █▄▄▄█ █▀██▀▀█▄ ▀▄█ ▀██ ▄█▄ ▀▄▀█▀▄▀▀▄▀ ▄ ",
  "       ▀  ▀ ▀     ▀▀    ▀   ▀▀   ▀ ▀▀▀ ▀▀",
].join("\n");
