import generateFiscalReceipt from "./index.js";
import receiptConfig from "../../config/receiptConfig.js";
import { fiscalReceiptDataMock } from "../../mock.js";

describe("generateFiscalReceipt", () => {
  it("should has this structure", async () => {
    const expectedReceipt = [
      "              ТОВ ТЕСТ ПРРО             ",
      '              Кафе "Мʼята"              ',
      "  Дніпропетровська область, м. Дніпро,  ",
      "   Амур-Нижньодніпровський район, вул.  ",
      "    Шолом-Алейхема, 4, кв. (Офіс) 31    ",
      "               ІД 12345678              ",
      "----------------------------------------",
      "2204109600#                             ",
      "12345678                                ",
      "ADCC123123                              ",
      "Вино игристое 2 x 130,02   260,04   ДГ",
      "вкусное                               ",
      "",
      "2204888600#                             ",
      "Сир           4 x 260,00  1040,00    Д",
      "",
      "----------------------------------------",
      "Готівкою                       284,26грн",
      "Карткою                        100,00грн",
      "----------------------------------------",
      "Сума                           384,26грн",
      "ПДВ 20% Г 20%                      29,25",
      "Акциз 5% Д 5%                      18,29",
      "----------------------------------------",
      "До сплати                      384,30грн",
      "Заокруглення                     0,04грн",
      "----------------------------------------",
      "ПриватБанк                              ",
      "S1260S6Y                                ",
      "Оплата                                  ",
      "ЕПЗ                     4422********6333",
      "ПЛАТІЖНА СИСТЕМА                    VISA",
      "КОД АВТ.                          159345",
      "RRN                         083998389823",
      "КАСИР                      .............",
      "ДЕРЖАТЕЛЬ ЕПЗ              .............",
      "",
      "----------------------------------------",
      "               2462757750               ",
      "           16.05.2024 19:29:35          ",
      "                 ОНЛАЙН                 ",
      "               4000244601               ",
      "             ФІСКАЛЬНИЙ ЧЕК             ",
      "               Poster POS               ",
    ].join("\n");
    expect(
      await generateFiscalReceipt({
        ...fiscalReceiptDataMock,
        receiptConfig,
      }),
    ).toEqual(expectedReceipt);
  });
});
